01_サーバレス時代の負荷テスト戦略/loadtester/script.yml
config:
  target: 'https://gatjk9gwc4.execute-api.ap-northeast-1.amazonaws.com/dev/'
  phases:
    - duration: 59
      arrivalRate: 3154
    - duration: 78
      arrivalRate: 3529
  plugins:
    cloudwatch:
      namespace: serverless-artillery-loadtest
scenarios:
  - flow:
      - get:
          url: /